'''
Напишіть програму, яка обчислює індекс маси тіла (ІМТ) людини. 
Ваша програма повинна починатися з читання зросту і ваги користувача. 
Потім слід використовувати одну з наступних двох формул для обчислення 
ІМТ перед його відображенням. Якщо читати зростання в дюймах і вага в фунтах, 
то індекс маси тіла розраховується за такою формулою:

                    BMI = (weight / height × height) × 703

Якщо читати зростання в метрах, а вага в кілограмах, 
то індекс маси тіла розраховується за такою трохи більш простою формулою:

                    BMI = (weight / height × height)

Користувачу потрібно надати можливість обрати одиниці виміру




'''