'''
На змагання з квідичу прийшло n студентів. 
Їм необхідно об'єднатися в дві команди. 
Для цього кожному учаснику видали свій унікальний номер. 
Гамблдор оголосив, що всі учасники з непарними номерами 
гратимуть в команді «Гріфендор», а всі інші - в команді «Слизерін». 
Виведіть у стовпчик номери всіх дітей, які будуть грати в команді «Гріфендор».
Користувач вводить число n - число дітей, які прийшли на змагання. 
Програма повинна вивести в стовпчик всі номери гравців команди «Гріфендор» 
- непарні числа від 1 до n.
'''

n=int(input("кількість дітей які прийшли на мач:"))

print("номери гравців з команди гріфіндор")
if(n+1>1):
    for number in range(1,n+1):
        if(number%2!=0):
            print(number)