'''
Програма повинна запитати, яка температура на вулиці, 
і надрукувати одну з трьох відповідей: 
"Холодно!", "Тепло!", "Спекотно!". 
Ось схема роботи:

якщо введена температура більше 20 перевірити:
якщо введена температура більше 35 Друкувати : "Спекотно!" інакше Друкувати: "Тепло!"
в усіх інших випадках Друкувати: "Холодно!"

використовувати вкладений умовний оператор

'''

# Можливі відповіді: "Холодно!", "Тепло!", "Спекотно!".
# Тепло - це температура від 20 до 35.
t=float(input('Програма повинна запитати, яка температура на вулиці?'))
if(t>20):
    if(t>35):
        print("Спекотно!")
    else:
        print("Тепло!")
else:
    print("Холодно!")