'''
Напишіть калькулятор: програма отримує два числа 
і операцію, здійснює операцію і друкує результат.
Програма виконує такі операції: 
"+" - додавання, 
"-" - відняти від першого числа друге, 
"*" - помножити, 
"/" - розділити перше число на друге. 
Якщо введена якась інша операція, 
потрібно надрукувати рядок, який вказаний у змінній 
err1: "Помилка: невідома операція.
"Якщо введена операція ділення, і друге число дорівнює нулю, 
потрібно надрукувати рядок err2: "Помилка: ділити на нуль не можна."

'''
err1 = "Помилка: невідома операція."
err2 = "Помилка: ділити на нуль не можна."

operations={
    "*":(lambda a,b:a*b),
    "/":(lambda a,b:a/b),
    "+":(lambda a,b:a+b),
    "-":(lambda a,b:a-b)
}

a=float(input("number1:"))
b=float(input("number2:"))

op=input("operatin:")

if(op in operations):
    if(op=="/" and b==0):
        print(err2)
    else:
        result=operations[op](a,b)
        print(int(result) if int(result)==result else result)
else:
    print(err1)
