'''
Заведіть змінну answer і запишіть туди правильну відповідь.
Використовуйте функцію input, щоб загадати загадку користувачеві
і записати його відповідь в нову змінну.

В умовному операторі порівняйте відповідь користувача з answer. 
Якщо відповідь вірна, то привітайте користувача з правильною відповідю. 
Якщо немає - висловіть співчуття.
'''

answer="8x"

answerInput=input("(4x^2)'=")
if(answer==answerInput):
    print("Вітаю ви відповіли правельно")
else:
    print("Мені шкода ви невгадали")