'''
Трикутник можна класифікувати, виходячи з довжин його сторін, 
на рівносторонній, рівнобедрений або прямокутний. 
Всі три сторони рівностороннього трикутника мають однакову довжину. 
Рівнобедрений трикутник має дві сторони, які мають однакову довжину, 
і третю сторону, яка має різну довжину. Якщо всі сторони мають різну довжину, 
то трикутник рівносторонній.
Напишіть програму, яка зчитує довжини трьох сторін трикутника від користувача. 
Потім відобразіть повідомлення, в якому вказано тип трикутника.

'''