'''
Напишіть програму, яка просить користувача ввести свій місяць і день народження. 
Потім ваша програма повинна повідомити знак зодіаку користувача як частину 
відповідного вихідного повідомлення.

Козеріг з 22 грудня по 19 січня
Водолій з 20 січня по 18 лютого
Риби з 19 лютого по 20 березня
Овен з 21 березня по 19 квітня
Телець з 20 квітня по 20 травня
Близнюки з 21 травня по 20 червня
Рак з 21 червня по 22 липня
Лев з 23 липня по 22 серпня
Діва з 23 серпня по 22 вересня
Терези з 23 вересня по 22 жовтня
Скорпіон з 23 жовтня по 21 листопада
Стрілець з 22 листопада по 21 грудня


'''